Revit 2024 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceLoopsOfSplittingCurves Property
 Curve elements forming a closed loop currently cannot be used as splitters and are ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedSurfaceLoopsOfSplittingCurves { get; }
Visual Basic
Public Shared ReadOnly Property DividedSurfaceLoopsOfSplittingCurves As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceLoopsOfSplittingCurves {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace